  print("\nВы входите в бескрайние пустыни...")

  print("Вокруг только жаркие каньоны,")
  print("   из которых будто нет выхода.")

  print("Вокруг только кактусы и песок.")
  print("☀️ Солнечный свет освещает почти всё вокруг")
  print("   и нету места, где можно спрятатся от него.")

  print("Под ногами шуршит песок")
  print("А вы идёте дальше, даже зная что из него может выползти песчаная змея")

  print("\nТолько изредка можно сойти на тропу")

  print("Вокруг тут очень тихо...")
  print("   вы так далеко отошли от гор, что уже не слышите снега")

  print("...")
  print("Дорога займёт много дней.")
  print("Вы входите в узкий горный каньон, благо солнце меньше тут пробивается")
  print("Но вы не учли одного.")
  print("Вы слышите очень громкое рычание с небольшой горы неподалёку...")

  print("\nЭТО ПУСТЫННЫЙ ЛЕВ!!!")

  print("Зверь бежит к вам, на огромной скорости.")
  print("⚔️ Похоже, без обороны тут не уйти")

  # =========================
  #  БОЙ С ЛЬВОМ
  # =========================
  reroll_used = False
  while hp_lion > 0 and hp > 0:

    print("\n" + "-" * 40)

    print(f"❤️ Ваше HP: {hp}/{max_hp} | " f"HP льва: {hp_lion}")

    print("-" * 40)

    command = input("⚔️ Enter — атака | 🎒 инвентарь: ").lower().strip()

    # =========================
    # 🎒 ИНВЕНТАРЬ
    # =========================

    if command == "инвентарь":
      (
          hp,
          inventory,
          equipped_weapon,
          equipped_accessory,
          weapon_bonus,
          accessory_bonus,
      ) = open_inventory(
          hp,
          max_hp,
          gold,
          inventory,
          equipped_weapon,
          equipped_accessory,
          weapon_bonus,
          accessory_bonus,
      )
      continue

    # =========================
    # 🎲 БРОСОК АТАКИ
    # =========================

    player_roll = random.randint(0, 9)

    print(f"\n🎲 Выпало число: {player_roll}")

    if clan == "Путник" and not reroll_used:

      answer = (
          input("🔄 Использовать переброс? " "(да/нет): ").lower().strip()
      )

      if answer == "да":

        player_roll = random.randint(0, 9)
        reroll_used = True

        print(f"🎲 Новый бросок: {player_roll}")

    # =========================
    # ⚔️ РАСЧЁТ УРОНА
    # =========================

    damage = 0

    if player_roll == 0:

      print("💨 ПРОМАХ!")
      print("Как только вы замахнулись, лев сделал рывок в сторону!")

    elif player_roll <= 3:

      damage = 10

      print("⚔️ Слабый удар!")
      print("Лев даже не отшагнул но разозлился ещё больше!")

    elif player_roll <= 7:

      damage = 20

      print("🗡️ Хороший удар!")
      print("💥 Вы точно попали по цели.")

    else:

      damage = 35

      print("💥 КРИТИЧЕСКИЙ УДАР!")
      print("⚔️ ВЫ ДЕЛАЕТЕ РЕЗКИЙ УДАР С РАЗВОРОТА И ОСТАВЛЯЕТЕ РАНУ ПРОТИВНИКУ!!!")

    # =========================
    # 🔮 ПАССИВКА МАГА
    # =========================

    if clan == "Маг" and damage > 0:

      damage = int(damage * 1.5)

      print("✨ Магическая сила усилила атаку!")
      print("🔮 Вокруг оружия вспыхивает магическая энергия.")

    # =========================
    # 🗡️ БОНУС ОРУЖИЯ
    # =========================

    damage += weapon_bonus

    if weapon_bonus > 0:

      print(f"🗡️ Заточенный меч добавил +{weapon_bonus} урона!")

    # =========================
    # ✨ БОНУС АМУЛЕТА
    # =========================

    damage += accessory_bonus

    if accessory_bonus > 0:

      print(f"✨ Амулет Орка добавил +{accessory_bonus} урона!")

    hp_lion -= damage

    print(f"У льва осталось {max(0, hp_lion)} HP")

    # =========================
    # 🏆 ПОБЕДА
    # =========================

    if hp_lion <= 0:

      print("\n🏆 ВЫ ПОБЕДИЛИ!")
      print("Лев принимает решение отступить, пропуская вам дорогу дальше!")
      print("Из звуков вокруг, опять лишь только песок шуршит под ногами")
      print("Вы осматриваетесь вокруг и продолжаете свой путь")

      location += 1

      break

    # =========================
    #  АТАКА ЛЬВА
    # =========================

    print("\n Лев готовится к атаке...")
    print("Тяжелыми и медленными шагами он обходит вас вокруг, ища момент для нападения")

    lion_at = random.randint(0, 9)

    if clan == "Рыцарь":

      lion_at = max(0, lion_at - 5)

      print("🛡️ Броня рыцаря смягчила удар!")

    hp -= lion_at

    print(f"💥 Лев нанёс {lion_at} урона!")
    print(f"❤️ Осталось HP: {max(0, hp)}/{max_hp}")

  # =========================
  # ☠️ СМЕРТЬ ОТ ЛЬВА
  # =========================

  if hp <= 0:

    print("\n💀 ВЫ ПОГИБЛИ...")
    print("Вы падаете на землю, прямо в песок")
    print("Лёгкий ветер пролетает вокруг")
    print("Похоже для льва, вы будете хорошей добычей...")
    print("🔄 Игра начинается заново!\n")

    continue

  # =========================
  #  НОВАЯ ЛОКАЦИЯ
  # =========================

  if location == 2:

    print("\n" + "=" * 40)
    print("Впереди виднеется магматический биом!")
    print("=" * 40)

    print("Вы идёте прямо к нему.")

    print("Здесь ещё жарче и зловеще!")
    print("По здешним землям текут целые реки лавы.")
    print("🌫️ Туман постепенно становится плотнее, из-за температуры.")
    print(" Тут всё ещё пробиваются отдельные лучи света.")

    print("👀 Через несколько минут вы замечаете кое-что необычное.")

    print("Это тропинка, при чём довольно хорошо проложенная!")
    print("🥾 Она идёт далеко в неизвестность")

    print("🗺️ Похоже, это единственная дорога, которая ведёт дальше.")
